In [6]:
#Load the data


import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import statistics

In [7]:
#Read the data

df=pd.read_csv("StudentsPerformance.csv")
print("Number of data points : ",df.shape[0])
df.head()

Number of data points :  1000

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [3]:
 # 1. Find out how many males and females participated in the test.


df=df.groupby("gender").sum()
print(df)

        math score  reading score  writing score
gender
female       32829          37602          37538
male         33172          31593          30581

In [4]:
# The number of females participated is 518 and the number of males participated is 482

In [8]:
# 2.The students' parental level of education

df["parental level of education"].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [9]:
# most of the parents have college level of education(226) whereas very few parents have master's degree(59)

In [11]:
# 3a. Who scores the most on average for math, reading and writing based on Gender

df1=df.groupby(["gender"]).mean()
df2=df1['math score'].sort_values(ascending=False)
df2
df3=df1['reading score'].sort_values(ascending=False)
df3
df4=df1['writing score'].sort_values(ascending=False)
df4
sum=df2+df3+df4
sum

gender
female    208.434363
male      197.813278
dtype: float64

In [12]:
#Female scored the most average score

In [13]:
# 3b. Who scores the most on average for math, reading and writing based on Test preparation course

df5 = df.groupby(["test preparation course"]).mean()
df6 = df5['math score']
df6
df7=df5['reading score']
df7
df8=df5['writing score']
df8
sum=df6+df7+df8
sum

test preparation course
completed    218.826816
none         194.665109
dtype: float64

In [14]:
# most of the students completed the test preparation course

In [15]:
# 4a.the scoring variation for math, reading and writing based on Gender

df9=df.groupby(["gender"]).std()
df10=df9['math score'].sort_values()
df10
df11=df9['reading score'].sort_values()
df11
df12=df9['writing score'].sort_values()
df12
sum=df10+df11+df12
sum

gender
male      42.933230
female    45.285788
dtype: float64

In [16]:
#females scored more than males

In [17]:
# 4b.The scoring variation for math, reading and writing based on Test preparation course

df13=df.groupby(["test preparation course"]).std()
df14=df13['math score']
df14
df15=df13['reading score']
df15
df16=df13['writing score']
df16
sum=df14+df15+df16
sum

test preparation course
completed    41.295831
none         45.356252
dtype: float64

In [18]:
#The students who didnt complete test preparation course scored slightly more than those completed

In [19]:
# 5 bonus points to the top 25% of students based on their maths score

Third_quartile=np.quantile(df['math score'],0.75)
Third_quartile

77.0

In [20]:
math_score=df.sort_values(by=['math score'],ascending=False)
n=25
math_score.head(int(len(math_score)*(n/100)))

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
856,male,group E,some high school,standard,completed,77,76,77
855,male,group E,associate's degree,free/reduced,completed,77,69,68
854,male,group D,some high school,standard,completed,77,68,69
853,male,group D,associate's degree,free/reduced,none,77,78,73
852,male,group D,some college,free/reduced,none,77,62,64